using System;
using UnityEngine.UI;

[Serializable]
public class SaveData
{
    // セーブしたいもの---------------------------------------------------------------
    public int Progress;
    public int[] Star = new int[9];
    public string[] Timer = new string[9];
    public string[,] ClearTime = new string[9, 3]{
        { "9999", "0000", "0000" },    // チュートリアル
        { "0025", "0030", "0040" },     // ステージ1
        { "0025", "0030", "0040" },     // ステージ2
        { "0035", "0040", "0050" },     // ステージ3
        { "0030", "0040", "0050" },     // ステージ4
        { "0030", "0040", "0050" },     // ステージ5
        { "0035", "0045", "0055" },     // ステージ6
        { "0040", "0045", "0055" },     // ステージ7
        { "0045", "0055", "0065" }      // ステージ8
    };
    //--------------------------------------------------------------------------------
}
