using System;
using UnityEngine.UI;

[Serializable]
public class SaveData
{
    // セーブしたいもの---------------------------------------------------------------
    public int Progress;
    public string[] Timer = new string[9];
    public int[] Star = new int[9];
    public int[,] ClearTime = new int[9, 3]{
        {9999,9999,9999 },    // チュートリアル
        { 25, 30, 40 },     // ステージ1
        { 25, 30, 40 },     // ステージ2
        { 35, 40, 50 },     // ステージ3
        { 30, 40, 50 },     // ステージ4
        { 30, 40, 50 },     // ステージ5
        { 35, 45, 55 },     // ステージ6
        { 40, 45, 55 },     // ステージ7
        { 45, 55, 65 }      // ステージ8
    };
    //--------------------------------------------------------------------------------
}