using System;
using UnityEngine.UI;

[Serializable]
public class SaveData
{
    // セーブしたいもの---------------------------------------------------------------
    public int Progress;
    public string[] Timer = new string[8];
    public int[] Star = new int[8];
    public int[,] ClearTime = new int[8, 3]{
        { 30, 100, 130 },     // ステージ1
        { 30, 100, 130 },     // ステージ2
        { 30, 100, 130 },     // ステージ3
        { 30, 100, 130 },     // ステージ4
        { 30, 100, 130 },     // ステージ5
        { 30, 100, 130 },     // ステージ6
        { 30, 100, 130 },     // ステージ7
        { 30, 100, 130 }      // ステージ8
    };
    //--------------------------------------------------------------------------------
}